# Задача 27618 kompege

from turtle import *

tracer(0)               # Скорость отрисовки
screensize(2000,2000)   # Включение скролла окна
s = 20                  # Масштаб

for i in range(2):  # Повтори 2 х
    forward(3*s)    # Вперёд 3
    left(90)        # Налево 90
    back(10*s)      # Назад 10
    left(90)        # Налево 90
# ]

penup()         # Поднять хвост
back(10*s)      # Назад 10
right(90)       # Направо 90
forward(8*s)    # Вперёд 8
left(90)        # Налево 90

pendown()       # Опустить хвост

for i in range(2):  # Повтори 2 [
    forward(16*s)   # Вперёд 16
    right(90)       # Направо 90
    forward(8*s)    # Вперёд 8
    right(90)       # Направо 90
#]

# Нарисовать координатную сетку
penup() # Поднять хвост
for x in range(-15, 15):
    for y in range(-15,15):
        setpos(x*s, y*s)    # Переместиться в позицию (x*s, y*s)
        dot(3)              # Отметить точку радиуса 3 в текущей позиции

done()  # Ждать после отрисовки