k = 0   # счетчик для количества найденных чисел, удовлетворяющих условиям задачи
for n in range(6_300_000, 10_000_000):

    x = n   # оберегаем n от изменений, так как нам нужно его значение для вывода

    #=================================================#
    # Алгоритм разложения числа на простые множители  #
    #=================================================#
    A = []
    for i in range(2, int(n**0.5) + 1):
        while x % i == 0:
            A.append(i)
            x //= i
    if x > 1:   # цикл может прерваться раньше, чем x будет равен 1, если x - простое число
        A.append(x)
    #=================================================#

    # Проверяем, что в разложении ровно 3 простых множителя
    if len(A) != 3:
        continue
    
    # Проверяем, что все простые множители содержат цифру 3 или 4
    if all("3" in str(i) or "4" in str(i) for i in A):
        print(n, max(A))
        k += 1
        
    if k == 5:
        break
